# Customer Segmentation on Mall Customers Data

In [50]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [34]:
data = pd.read_csv("../dataset/Mall_Customers.csv")
data.head(10)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

In [35]:
data.sample(10)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
1             2    Male   21                  15                      81
143         144  Female   32                  76                      87
75           76    Male   26                  54                      54
101         102  Female   49                  62                      48
184         185  Female   41                  99                      39
24           25  Female   54                  28                      14
145         146    Male   28                  77                      97
191         192  Female   32                 103                      69
180         181  Female   37                  97                      32
53           54    Male   59                  43                      60

In [36]:
data.shape

(200, 5)

In [37]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [38]:
data.duplicated().sum()

np.int64(0)

In [39]:
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [40]:
data.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [41]:
data["Spending Score (1-100)"].unique()

array([39, 81,  6, 77, 40, 76, 94,  3, 72, 14, 99, 15, 13, 79, 35, 66, 29,
       98, 73,  5, 82, 32, 61, 31, 87,  4, 92, 17, 26, 75, 36, 28, 65, 55,
       47, 42, 52, 60, 54, 45, 41, 50, 46, 51, 56, 59, 48, 49, 53, 44, 57,
       58, 43, 91, 95, 11,  9, 34, 71, 88,  7, 10, 93, 12, 97, 74, 22, 90,
       20, 16, 89,  1, 78, 83, 27, 63, 86, 69, 24, 68, 85, 23,  8, 18])

In [42]:
data.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [43]:
data["Gender"].value_counts()

Gender
Female    112
Male       88
Name: count, dtype: int64

In [44]:
gender_counts = data["Gender"].value_counts()
gender_percentage = data["Gender"].value_counts(normalize=True) * 100
print(gender_percentage)

Gender
Female    56.0
Male      44.0
Name: proportion, dtype: float64

In [45]:
data.sample(10)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
123         124    Male   39                  69                      91
128         129    Male   59                  71                      11
133         134  Female   31                  72                      71
135         136  Female   29                  73                      88
76           77  Female   45                  54                      53
52           53  Female   31                  43                      54
129         130    Male   38                  71                      75
51           52    Male   33                  42                      60
134         135    Male   20                  73                       5
56           57  Female   51                  44                      50

In [46]:
# dropping the unnecessary column CustomerID
data = data.drop("CustomerID", axis=1)
data.sample(10)

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
144    Male   25                  77                      12
130    Male   47                  71                       9
65     Male   18                  48                      59
109    Male   66                  63                      48
14     Male   37                  20                      13
73   Female   60                  50                      56
158    Male   34                  78                       1
164    Male   50                  85                      26
118  Female   51                  67                      43
32     Male   53                  33                       4

In [47]:
data["Gender"] = data["Gender"].replace(
    {
        "Male": 0,
        "Female": 1
    }
)
data.sample(10)

/tmp/ipykernel_17452/3435293700.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data["Gender"] = data["Gender"].replace(

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
32        0   53                  33                       4
117       1   49                  65                      59
19        1   35                  23                      98
110       0   65                  63                      52
1         0   21                  15                      81
186       1   54                 101                      24
115       1   19                  65                      50
37        1   30                  34                      73
125       1   31                  70                      77
126       0   43                  71                      35

In [48]:
data["Gender"].value_counts()

Gender
1    112
0     88
Name: count, dtype: int64

In [49]:
data.corr()

,Gender,Age,Annual Income (k$),Spending Score (1-100)
Gender,1.000000,-0.060867,-0.056410,0.058109
Age,-0.060867,1.000000,-0.012398,-0.327227
Annual Income (k$),-0.056410,-0.012398,1.000000,0.009903
Spending Score (1-100),0.058109,-0.327227,0.009903,1.000000

In [51]:
# splitting the data
X_train, X_test = train_test_split(
    data,
    test_size=0.15,
    random_state=21
)
print(data.shape, X_train.shape, X_test.shape)

(200, 4) (170, 4) (30, 4)